let arr = [3, 1, 4, 5, 9, 2, 6, 8, 7];

let arr2 = [
  3, 15, 27, 42, 56, 72, 84, 91, 7, 14, 28, 33, 46, 58, 63, 76, 89, 99, 1, 10,
  21, 36, 48, 60, 70, 80, 92, 5, 18, 30, 40, 51, 65, 73, 85, 96, 8, 17, 26, 38,
  47, 54, 67, 78, 86, 98, 2, 11, 24, 37, 49, 55, 68, 79, 90, 100, 4, 19, 31, 41,
  53, 62, 75, 83, 93, 97, 6, 13, 25, 35, 44, 50, 64, 74, 88, 95, 9, 20, 29, 39,
  52, 61, 66, 71, 81, 94, 12, 22, 32, 43, 57, 69, 77, 82, 87, 59,
];

function linearSearch(arr, n) {
  let count = 0;

  for (let i = 0; i <= arr.length - 1; i++) {
    count++;
    if (arr[i] == n) {
      console.log(`執行次數: ${count}`);
      return `index: ${i}`;
    }
  }
  console.log(`執行次數: ${count}`);
  return "not defined.";
}

console.log(linearSearch(arr2, 32));
